In [11]:
import pandas as pd

In [12]:
df1 = pd.read_csv('student_info.csv')
df1

   Student ID     Name  Age Grade
0         101    Alice   20     A
1         102      Bob   21     B
2         103  Charlie   19     A
3         104    David   22     C
4         105      Eve   20     B

In [13]:
df2 = pd.read_csv('student_scores.csv')
df2

   Student ID  Math Score  English Score  Science Score
0         101          85             78             92
1         102          76             88             81
2         103          90             95             89
3         104          65             70             75
4         105          80             82             87

In [14]:
df3 = pd.concat([df1, df2], axis=1)
df3

,Student ID,Name,Age,Grade,Student ID,Math Score,English Score,Science Score
0,101,Alice,20,A,101,85,78,92
1,102,Bob,21,B,102,76,88,81
2,103,Charlie,19,A,103,90,95,89
3,104,David,22,C,104,65,70,75
4,105,Eve,20,B,105,80,82,87